In [11]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [12]:
data = np.arange(8)

In [13]:
data

array([0, 1, 2, 3, 4, 5, 6, 7])

In [14]:
index = ['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8']

In [15]:
index

['row 1', 'row 2', 'row 3', 'row 4', 'row 5', 'row 6', 'row 7', 'row 8']

In [16]:
series_obj = Series(data,index)

In [17]:
series_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [18]:
series_obj['row 7']

6

In [19]:
series_obj[7]

7

In [20]:
series_obj[[0,7]]

row 1    0
row 8    7
dtype: int64

In [21]:
df = DataFrame(np.random.rand(36).reshape((6,6)), 
              index = ['row 1','row 2','row 3','row 4','row 5','row 6'],
              columns = ['column 1', 'column 2', 'column 3', 'column 4', 'column 5', 'column 6'])

In [22]:
df

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.172483  0.845935  0.579644  0.991783  0.761518  0.324283
row 2  0.889616  0.702509  0.124950  0.463735  0.516763  0.152746
row 3  0.230402  0.769961  0.366133  0.213191  0.717906  0.367266
row 4  0.668974  0.207710  0.938052  0.085622  0.430834  0.435893
row 5  0.504341  0.720270  0.758745  0.975245  0.417021  0.560301
row 6  0.106706  0.266871  0.902252  0.428450  0.648730  0.449017

In [23]:
df.loc[['row 1', 'row 2'], ['column 1', 'column 2']]

       column 1  column 2
row 1  0.172483  0.845935
row 2  0.889616  0.702509

In [24]:
series_obj['row 3': 'row 6']

row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [25]:
series_obj['row 3': 'row 6' : -1]

Series([], dtype: int64)

In [26]:
series_obj['row 3'::]

row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [27]:
series_obj[: 'row 6':]

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [28]:
df['row 1': 'row 5']

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.172483  0.845935  0.579644  0.991783  0.761518  0.324283
row 2  0.889616  0.702509  0.124950  0.463735  0.516763  0.152746
row 3  0.230402  0.769961  0.366133  0.213191  0.717906  0.367266
row 4  0.668974  0.207710  0.938052  0.085622  0.430834  0.435893
row 5  0.504341  0.720270  0.758745  0.975245  0.417021  0.560301

In [29]:
df.loc[['row 1', 'row 5'],['column 2','column 5']]

       column 2  column 5
row 1  0.845935  0.761518
row 5  0.720270  0.417021

In [30]:
#Checking if individual values in the DF is greaer than 0.5

In [31]:
df>0.5

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False      True      True      True      True     False
row 2      True      True     False     False      True     False
row 3     False      True     False     False      True     False
row 4      True     False      True     False     False     False
row 5      True      True      True      True     False      True
row 6     False     False      True     False      True     False

In [32]:
series_obj[series_obj > 5]

row 7    6
row 8    7
dtype: int64

In [37]:
df_gt5 = df[df > 0.5] #Need to check how the NaN can be set to 0 in a single statement

In [38]:
df_gt5

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.552963  0.745055  0.557071       NaN       NaN  0.762608
row 2       NaN  0.839227       NaN       NaN       NaN       NaN
row 3       NaN  0.973800       NaN  0.695068  0.875710       NaN
row 4  0.573031       NaN  0.991325  0.600231  0.933796  0.718309
row 5       NaN       NaN       NaN  0.979794  0.806865  0.920855
row 6  0.760799       NaN  0.707521       NaN       NaN       NaN

In [39]:
df_gt5.isnull()

       column 1  column 2  column 3  column 4  column 5  column 6
row 1     False     False     False      True      True     False
row 2      True     False      True      True      True      True
row 3      True     False      True     False     False      True
row 4     False      True     False     False     False     False
row 5      True      True      True     False     False     False
row 6     False      True     False      True      True      True

In [44]:
filled_df = df_gt5.fillna(0)
# fillna({0:0.1, 5:1.25}) 
# for filling all Nan values in 
#      0th index with 0.1 
#      5th index with 1.25

In [41]:
filled_df

       column 1  column 2  column 3  column 4  column 5  column 6
row 1  0.552963  0.745055  0.557071  0.000000  0.000000  0.762608
row 2  0.000000  0.839227  0.000000  0.000000  0.000000  0.000000
row 3  0.000000  0.973800  0.000000  0.695068  0.875710  0.000000
row 4  0.573031  0.000000  0.991325  0.600231  0.933796  0.718309
row 5  0.000000  0.000000  0.000000  0.979794  0.806865  0.920855
row 6  0.760799  0.000000  0.707521  0.000000  0.000000  0.000000